# Напишите функцию, которая принимает три числа и возвращает максимальное из них.
# def find_max(a, b, c):
#     list_num = [a, b, c]
#     return max(list_num, key=lambda num: num)
#
# # Пример использования:
# result = find_max(15, 177, 20)
# print(result)  # Ожидаемый вывод: 20


# ### Задача: Подсчет гласных букв
# Напишите функцию, которая принимает строку и возвращает количество гласных букв в этой строке.
# Гласные буквы: 'a', 'e', 'i', 'o', 'u' (не учитывайте регистр).

# def count_vowels(s):
#     vowels = 'aeiou'
#     counter = 0
#     for letter in s.lower():
#         if letter in vowels:
#             counter += 1
#     return counter

# Пример использования:
# result = count_vowels("Hello, World!")
# print(result)  # Ожидаемый вывод: 3


